(function() {
    /**
     * 打分相关
     */
    
    window.SOCORED = 1000;  // 有打分的数据
    window.NOSCORED = 3000;  //没有打分的电影

    var demo = []
    for (var i=0; i<=100; i++) {
        demo.push(i);   
    }
    window.CHINA_SCORE = demo;    //中国电影0-10分数据 以.1为分割
    window.FOREIGN_SCORE = demo;   //国外电影0-10分数据

    window.COMEDY_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]
    window.FICTION_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]
    window.LOVE_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]  //爱情分数分布
    window.HORROR_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]
    window.FIGHT_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]
    window.COMEDY_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]
    window.CARTOON_INT_NUM = [1, 2, 3, 4, 3, 2, 1, 3, 2, 1]
    /**
     * 电影数量分析
     */
    window.NUM_COUNTRY = [10, 52, 200, 334, 390, 330, 220, 390, 330, 220]

    window.NUM_YEAR_TOTAL = [120, 132, 101, 134, 90, 230, 210, 90, 230, 210]
    window.NUM_YEAR_CN = [220, 182, 191, 234, 290, 330, 310, 290, 330, 310]
    window.NUM_YEAR_GAT = [220, 182, 191, 234, 290, 330, 310, 290, 330, 310]
    window.NUM_YEAR_IND = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410]
    window.NUM_YEAR_USA = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410]
    window.NUM_YEAR_KOR = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410]
    window.NUM_YEAR_JAP = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410]


    
    /**
     * TOP20
     */
    window.SCORE_TOP_NAMES = ["衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子"]
    window.SCORE_TOP_VALUES = [5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20,5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20]

    window.SCORE_NUM_TOP_NAMES = ["衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子"]
    window.SCORE_NUM_TOP_VALUES = [5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20,5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20]

    window.COMMENT_TOP_NAMES = ["衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子"]
    window.COMMENT_TOP_VALUES = [5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20,5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20]
})();