(function() {
    /**
     * 打分相关
     */
    
    window.SOCORED = 2088;  // 有打分的数据
    window.NOSCORED = 7750;  //没有打分的电影

    window.CHINA_SCORE = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 1, 1, 1, 4, 3, 4, 4, 5, 1, 7, 10, 5, 9, 13, 4, 11, 8, 14, 6, 5, 7, 13, 6, 5, 8, 5, 8, 9, 5, 8, 13, 3, 3, 8, 13, 14, 12, 9, 12, 8, 13, 7, 3, 8, 13, 7, 8, 7, 7, 9, 2, 1, 3, 3, 3, 3, 1, 3, 5, 1, 3, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0];    //中国电影0-10分数据 以.1为分割
    window.FOREIGN_SCORE = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 3, 3, 5, 7, 3, 5, 7, 5, 3, 6, 7, 10, 4, 9, 17, 20, 13, 12, 24, 15, 18, 22, 22, 23, 27, 35, 36, 40, 39, 46, 51, 40, 44, 50, 54, 58, 54, 70, 63, 59, 66, 48, 55, 30, 46, 40, 44, 47, 37, 30, 29, 16, 21, 15, 17, 13, 20, 14, 11, 14, 8, 6, 5, 5, 6, 3, 4, 3, 0, 0, 0, 0, 0, 0];   //国外电影0-10分数据

    // [0]:0-1  [1]:1.1-2 [2]:2.1-3 [3]:3.1-4 [4]:4.1-5 
    // [5]:5.1-6 [6]:6.1-7 [7]:7.1-8 [8]:8.1-9 [9]:9.1-10
    window.COMEDY_INT_NUM = [0, 0, 9, 35, 61, 128, 146, 87, 35, 5]  //喜剧按证书分割0-0.9   1-
    window.FICTION_INT_NUM = [0, 0, 17, 36, 44, 55, 61, 28, 16, 3]
    window.LOVE_INT_NUM = [0, 0, 6, 18, 41, 59, 72, 40, 6, 0]  //爱情分数分布
    window.HORROR_INT_NUM = [0, 0, 25, 73, 135, 181, 148, 54, 17, 0]
    window.FIGHT_INT_NUM = [0, 0, 12, 42, 50, 69, 71, 36, 13, 0]
    window.CARTOON_INT_NUM = [0, 0, 0, 2, 6, 21, 41, 37, 34, 4]
    /**
     * 电影数量分析
     */
    
    window.NUM_YEAR_TOTAL = [120, 132, 101, 134, 90, 230, 210, 90, 230, 210, 310]
    window.NUM_YEAR_CN = [220, 182, 191, 234, 290, 330, 310, 290, 330, 310, 310]
    window.NUM_YEAR_GAT = [220, 182, 191, 234, 290, 330, 310, 290, 330, 310, 310]
    window.NUM_YEAR_IND = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410, 310]
    window.NUM_YEAR_USA = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410, 310]
    window.NUM_YEAR_KOR = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410, 310]
    window.NUM_YEAR_JAP = [150, 232, 201, 154, 190, 330, 410, 190, 330, 410, 310]
    
    
    window.NUM_COUNTRY = [2668, 246, 2425, 299, 288, 891, 170, 411, 595, 328]
    
    /**
     * TOP20
     */
    window.SCORE_TOP_NAMES = ['汉纳·盖茨比告别秀：娜娜 Hannah Gadsby: Nanette', '哈库梅伊与蜜珂析OVA：螺丝与床 / 地炉与博弈 ハクメイとミコチOVA「ネジとベッド と 囲炉裏と博打」', '绝对要赢 羽生结弦 向自己发起的挑战 絶対に勝ってやる 羽生結弦 自分への挑戦', '哈姆雷特 Hamlet', '超感猎杀：完结特别篇 Sense8 Finale Special', '我的小马驹：最棒的礼物 My Little Pony: Best Gift Ever', '何以为家 كفرناحوم', "人人都在聊杰米 Everybody's Talking About Jamie", '修罗天魔～骷髅城的七人 Season极 修羅天魔～髑髏城の七人 Season極', '我不是药神', '天鹅湖 Swan Lake', '假面骑士EX-AID Trilogy Another Ending Part III 假面骑士Genm VS 假面骑士Lazer 仮面ライダーゲンムVSレーザー', "布朗夫人的儿子们2018新年特辑 Mrs. Brown's Boys: New Year Special 2018,CSI: Mammy", '红色 Red', '绿皮书 Green Book', '机动战士高达THE ORIGIN VI 赤色彗星诞生 機動戦士ガンダム THE ORIGIN 誕生 赤い彗星', "阿库·汉姆《吉赛尔》 Akram Khan's Giselle", '续·终物语 続・終物語', '瑞奇·热维斯：人性 Ricky Gervais: Humanity', "布朗夫人的儿子们：2018圣诞特别篇 Mrs. Brown's Boys Christmas Special: Exotic Mammy"]
    window.SCORE_TOP_VALUES = [9.4, 9.3, 9.3, 9.3, 9.2, 9.2, 9.1, 9.1, 9.1, 9.0, 9.0, 9.0, 9.0, 9.0, 8.9, 8.9, 8.9, 8.8, 8.8, 8.8]

    window.SCORE_NUM_TOP_NAMES = ['我不是药神', '绿皮书 Green Book', '头号玩家 Ready Player One', '无名之辈', '红海行动', '西虹市首富', '一出好戏', '无双 無雙', '海王 Aquaman', '唐人街探案2', '何以为家 كفرناحوم', '调音师 Andhadhun', '毒液：致命守护者 Venom', '复仇者联盟3：无限战争 Avengers: Infinity War', '无问西东', '小偷家族 万引き家族', '邪不压正', '蜘蛛侠：平行宇宙 Spider-Man: Into the Spider-Verse', '影', '动物世界']
    window.SCORE_NUM_TOP_VALUES = [1551579.0, 1129289.0, 1043732.0, 834317.0, 830273.0, 803459.0, 755061.0, 751854.0, 743582.0, 714259.0, 705231.0, 701087.0, 674655.0, 670038.0, 608727.0, 606710.0, 567506.0, 485416.0, 484456.0, 445796.0]

    window.COMMENT_TOP_NAMES = ["衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","衬衫","羊毛衫","雪纺衫","裤子","高跟鞋","袜子","羊毛衫","雪纺衫","裤子","高跟鞋","袜子"]
    window.COMMENT_TOP_VALUES = [5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20,5, 20, 36, 10, 10, 20, 20, 36, 10, 10, 20]
})();